import type { RoadmapSubject } from "../types";

export const ROADMAP_LIST: Array<RoadmapSubject> = [
  {
    title: 'GIT',
  },
  {
    title: 'HTML',
    list: [
      'Базовый HTML',
      'Семантические теги',
      'Таблицы',
      'Формы',
      'Изображения',
    ],
  },
  {
    title: 'CSS',
    list: [
      'Расположение стилей',
      'Селекторы',
      'Каскадность',
      'Псевдоселекторы',
      'Псевдоклассы',
      'Блочная модель',
      'Display',
      'Позиционирование',
      'Шрифты',
      'Форматирование текста',
      'Изображения',
      'Flexbox',
      'Grid Layout',
      'Адаптив',
      'Анимация',
      'Переменные',
      'БЭМ',
    ],
  },
  {
    title: 'JavaScript',
    list: [
      'Переменные',
      'Типы данных и методы работы с ними',
      'Операторы',
      'Ветвление',
      'Циклы',
      'Функции',
      'Объекты',
      'Массивы',
      'Map, Set',
      'Date',
      'JSON',
      'Рекурсия',
      'Область видимости',
      'setTimeout и setInterval',
      'Контекст',
      'Геттеры и сеттеры',
      'Прототипы, наследование',
      'Классы',
      'Обработка ошибок',
      'Promise',
      'Модули',
      'DOM',
      'Events',
      'Формы',
      'Сетевые запросы',
      'Хранение данных в браузере',
      'Веб-компоненты',
      'Регулярные выражения',
      'Event Loop',
    ],
  },
  {
    title: 'Webpack',
  },
  {
    title: 'SCSS',
    list: [
      '?',
    ],
  },
  {
    title: 'Vue 2',
    list: [
      '?',
    ],
  },
  {
    title: 'Nuxt 2',
    list: [
      '?',
    ],
  },
  {
    title: 'Vite',
  },
  {
    title: 'TypeScript',
    list: [
      '?',
    ],
  },
  {
    title: 'Vue 3',
    list: [
      '?',
    ],
  },
  {
    title: 'Nuxt 3',
    list: [
      '?',
    ],
  },
  {
    title: 'Docker',
    list: [
      '?',
    ],
  },
];
